game_api/app/controllers/scores_controller.rb

   def index
    @scores = Score.all.sort
---
SELECT "scores".* FROM "scores"

  def show
    @score = Score.find_by(id: params[:id])
---
SELECT  "scores".* FROM "scores" WHERE "scores"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @score = Score.create(score: params[:score], game: params[:game], player_id: params[:player_id], name: params[:name])
---
INSERT INTO "scores" ("score", "game", "player_id", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["score", 465], ["game", "dino"], ["player_id", 49], ["created_at", "2019-05-08 15:50:37.623824"], ["updated_at", "2019-05-08 15:50:37.623824"], ["name", "qeeqer"]]