game_api/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "werwerwr"], ["created_at", "2019-05-08 08:18:52.800140"], ["updated_at", "2019-05-08 08:18:52.800140"]]
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "werwerwr"], ["LIMIT", 1]]
---
  def create
    @user = User.find_or_create_by(name: params[:name])